#+STARTUP: content
#+TODO: TODO(t) DOIN(D) MYBE(M) | DONE(d) CANC(c)
#+TODO: oliv(o) mary(m) regi(r) lind(i) lori(c) adam(a) nina(n) | done(q)
* Weekly's
** Oct 23rd
*** O Weekly Agenda
**** See Globalyzer Lite

** Nov 2nd
*** Company Meeting
**** DONE [#A] Send Lori link to Lite videos (Mainly VS)
CLOSED: [2015-11-02 Mon 16:31] DEADLINE: <2015-11-02 Mon>
***** Mention that developers must manually insert "// $NON-NLS-L$
*** Product team meeting
**** TODO [#A] Look over Olivier's list of things that need to happen before Regina tests. Deadline and prioritize them.
* Globalyzer Lite
** TODO [#A] [2/11] Get Lite release ready                          :status meeting:
*** DONE [#A] [0/0] Look into lite eclipse click-ability     :status meeting:
CLOSED: [2015-10-27 Tue 18:43] :LOGBOOK: CLOCK: [2015-10-27 Tue 17:32]--[2015-10-27 Tue 17:32] =>  0:00
*** MYBE [#C] [0/1] Improve error messages (up to another day of time commitment is acceptable)
**** MYBE [#A] Go over error messages with Regina
*** TODO [#A] [3/5] ErrorLinkyThing/ClickableConsole 
**** DONE [#A] [1/1] Package up Lite with ErrorLinkyThing for Regina's testing.
CLOSED: [2015-10-30 Fri 15:16]
***** DONE [#B] When ready, deal with licensing setup for ErrorLinkyThing.
CLOSED: [2015-10-29 Thu 13:05]
**** DONE [#A] Commit updated plugin changes to Lingoport owned github..
CLOSED: [2015-10-30 Fri 15:42] DEADLINE: <2015-10-30 Fri>
***** DONE [#A] Share github repo with lp_? linda, lori, olivier
CLOSED: [2015-11-02 Mon 10:46]
**** DONE [#A] Remove debug messages
CLOSED: [2015-11-02 Mon 17:06]
**** regi [#A] [0/2] Test that ClickableConsole works for Relevant version of:
***** regi Eclipse
***** regi Java (7 and 8)
**** TODO [#A] Check in about what plugin details we want to change for ErrorLinkyThing
DEADLINE: <2015-11-03 Tue>
*** TODO [#B] [5/6] Any licensing stuff for Lite
**** DONE [#B] Licenses retrieved for all but a few
**** DONE [#B] Check up on a last few difficult licenses
CLOSED: [2015-10-29 Thu 12:57]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:53]--[2015-10-29 Thu 12:57] =>  0:04
CLOCK: [2015-10-29 Thu 12:07]--[2015-10-29 Thu 12:18] =>  0:11
:END:
**** DONE [#B] Put the licenses somewhere.
**** DONE [#B] Insure all links to licenses work.
CLOSED: [2015-10-29 Thu 12:52]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:42]--[2015-10-29 Thu 12:52] =>  0:10
CLOCK: [2015-10-29 Thu 12:37]--[2015-10-29 Thu 12:40] =>  0:03
:END:
**** DONE [#B] Putting the Lingoport license in with Lite
CLOSED: [2015-11-02 Mon 17:19]
***** DONE [#B] Need some license changes confirmed
CLOSED: [2015-11-02 Mon 17:07]
***** CANC [#B] Link to the open source licenses from the license file.
CLOSED: [2015-11-02 Mon 17:07]
****** No link necessary. I did mention their relative location though.
***** DONE [#C] Confirm naming / directory conventions.
CLOSED: [2015-11-03 Tue 10:19]
****** TODO [#C] Put everything in a "license" directory
**** TODO [#A] Put Lite's License up on our website (somewhere?)
*** TODO [#B] [0/3] Junit                                    :status meeting:
**** TODO [#A] Some tests fail.
DEADLINE: <2015-11-03 Tue>
This is due to lagging behind current refactoring. It doesn't indicate a program
problem. However, I should still probably refactor these.
**** TODO [#C] Add more coverage.
*** TODO [#C] Refactor eclipse-standard location
**** TODO [#A] Remove eclipse-enhanced, intellij, just use gnu (Update bug (5160?) with latest changes)
*** TODO [#B] [3/4] Internal Docs                            :status meeting:
**** done [#B] Regina's doc updates
CLOSED: [2015-10-30 Fri 15:02]
***** DONE [#A] Proof new version
CLOSED: [2015-10-30 Fri 18:11]
****** DONE [#B] Verify that there aren't other tweaks that Regina isn't aware of
CLOSED: [2015-10-30 Fri 18:11]
**** DONE [#A] Update --console-output "eclipse" eclipse screenshot.
CLOSED: [2015-11-02 Mon 17:47]
**** CANC [#A] Make the distinction between ScanSelectedItem and ScanParentDirectory clearer
CLOSED: [2015-10-27 Tue 11:57]
This may not have been clear to Michael Chen
**** TODO [#A] Document use of plugin for Lite
DEADLINE: <2015-10-29 Thu>
***** DONE [#C] Change Plugin Name
CLOSED: [2015-10-29 Thu 20:44] DEADLINE: <2015-10-29 Thu>
***** DONE [#A] Get the Plugin Working Again! 
CLOSED: [2015-10-30 Fri 13:08]
see: http://www.vogella.com/tutorials/EclipsePlugIn/article.html#deployplugin_overview
https://stackoverflow.com/questions/582391/installing-eclipse-3-4-plugins-in-a-directory-other-than-eclipse-home-plugins/582430#582430
***** DONE [#A] Double check that the new README is correct.
CLOSED: [2015-11-02 Mon 17:08]
***** TODO [#B] Look through help pages that aren't "globalyzer-lite-IDE-usage.html"
***** TODO [#A] Re-doc change from eclipse-enhanced to gnu
*** DONE [#B] [0/0] Add missing "intellij_IDEA" option.
CLOSED: [2015-10-30 Fri 19:41] DEADLINE: <2015-10-30 Fri>
*** TODO [#A] [0/1] Merge 4.8.5 into master. (Tell Regina first).
**** TODO [#A] Send mail to everyone post-merge
*** TODO [#A] [0/2] Any release Wrap up
**** TODO [#B] Check organizations of files for unzipped jar file
**** TODO [#A] Confirm no bugs
*** TODO [#A] Document requirements on testlink.
** Misc
*** DONE [#C] [0/0] Read more into, ask about design by contract.
CLOSED: [2015-10-28 Wed 00:33]
Ok that this setter-ish-thing doesn't accept null?
ProjectDetails.java:227 
addScan(@Nonnull Scan scan) { 
    if (scan == null) {
        return;
    }
    m_scans.add(scan
Answer: It's probably best to throw an error on null, but this is OK.
*** TODO [#B] [2/3] Look into lite encoding handing for UTF-16BE_NO_BOM
**** DONE [#A] Remind Mary
CLOSED: [2015-10-30 Fri 15:09] DEADLINE: <2015-10-30 Fri>
:LOGBOOK:
CLOCK: [2015-10-30 Fri 15:06]--[2015-10-30 Fri 15:09] =>  0:03
:END:
Mary said that it's a good feature request. But didn't imply that it was a 
release showstopper.
**** DONE [#B] Get final confirmation from O that it's ok to release with said problem.
CLOSED: [2015-11-02 Mon 10:47]
**** TODO [#B] Add to bugzilla.
* Competitors
** TODO [#D] Populate list
*** LRM competitor thing
*** Things mentioned by EMC
*** That startup company that wanted to view our demos
